espressif/esp-idf/components/soc/esp32p4/include/soc/hinf_reg.h
/**
 * SPDX-FileCopyrightText: 2022-2023 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** HINF_CFG_DATA0_REG register
 *  Configure sdio cis content
 */
#define HINF_CFG_DATA0_REG (DR_REG_HINF_BASE + 0x0)
/** HINF_DEVICE_ID_FN1 : R/W; bitpos: [15:0]; default: 26214;
 *  configure device id of function1 in cis
 */
#define HINF_DEVICE_ID_FN1    0x0000FFFFU
#define HINF_DEVICE_ID_FN1_M  (HINF_DEVICE_ID_FN1_V << HINF_DEVICE_ID_FN1_S)
#define HINF_DEVICE_ID_FN1_V  0x0000FFFFU
#define HINF_DEVICE_ID_FN1_S  0
/** HINF_USER_ID_FN1 : R/W; bitpos: [31:16]; default: 146;
 *  configure user id of function1 in cis
 */
#define HINF_USER_ID_FN1    0x0000FFFFU
#define HINF_USER_ID_FN1_M  (HINF_USER_ID_FN1_V << HINF_USER_ID_FN1_S)
#define HINF_USER_ID_FN1_V  0x0000FFFFU
#define HINF_USER_ID_FN1_S  16

/** HINF_CFG_DATA1_REG register
 *  SDIO configuration register
 */
#define HINF_CFG_DATA1_REG (DR_REG_HINF_BASE + 0x4)
/** HINF_SDIO_ENABLE : R/W; bitpos: [0]; default: 1;
 *  Sdio clock enable
 */
#define HINF_SDIO_ENABLE    (BIT(0))
#define HINF_SDIO_ENABLE_M  (HINF_SDIO_ENABLE_V << HINF_SDIO_ENABLE_S)
#define HINF_SDIO_ENABLE_V  0x00000001U
#define HINF_SDIO_ENABLE_S  0
/** HINF_SDIO_IOREADY1 : R/W; bitpos: [1]; default: 0;
 *  sdio function1 io ready signal in cis
 */
#define HINF_SDIO_IOREADY1    (BIT(1))
#define HINF_SDIO_IOREADY1_M  (HINF_SDIO_IOREADY1_V << HINF_SDIO_IOREADY1_S)
#define HINF_SDIO_IOREADY1_V  0x00000001U
#define HINF_SDIO_IOREADY1_S  1
/** HINF_HIGHSPEED_ENABLE : R/W; bitpos: [2]; default: 0;
 *  Highspeed enable in cccr
 */
#define HINF_HIGHSPEED_ENABLE    (BIT(2))
#define HINF_HIGHSPEED_ENABLE_M  (HINF_HIGHSPEED_ENABLE_V << HINF_HIGHSPEED_ENABLE_S)
#define HINF_HIGHSPEED_ENABLE_V  0x00000001U
#define HINF_HIGHSPEED_ENABLE_S  2
/** HINF_HIGHSPEED_MODE : RO; bitpos: [3]; default: 0;
 *  highspeed mode status in cccr
 */
#define HINF_HIGHSPEED_MODE    (BIT(3))
#define HINF_HIGHSPEED_MODE_M  (HINF_HIGHSPEED_MODE_V << HINF_HIGHSPEED_MODE_S)
#define HINF_HIGHSPEED_MODE_V  0x00000001U
#define HINF_HIGHSPEED_MODE_S  3
/** HINF_SDIO_CD_ENABLE : R/W; bitpos: [4]; default: 1;
 *  sdio card detect enable
 */
#define HINF_SDIO_CD_ENABLE    (BIT(4))
#define HINF_SDIO_CD_ENABLE_M  (HINF_SDIO_CD_ENABLE_V << HINF_SDIO_CD_ENABLE_S)
#define HINF_SDIO_CD_ENABLE_V  0x00000001U
#define HINF_SDIO_CD_ENABLE_S  4
/** HINF_SDIO_IOREADY2 : R/W; bitpos: [5]; default: 0;
 *  sdio function1 io ready signal in cis
 */
#define HINF_SDIO_IOREADY2    (BIT(5))
#define HINF_SDIO_IOREADY2_M  (HINF_SDIO_IOREADY2_V << HINF_SDIO_IOREADY2_S)
#define HINF_SDIO_IOREADY2_V  0x00000001U
#define HINF_SDIO_IOREADY2_S  5
/** HINF_SDIO_INT_MASK : R/W; bitpos: [6]; default: 0;
 *  mask sdio interrupt in cccr, high active
 */
#define HINF_SDIO_INT_MASK    (BIT(6))
#define HINF_SDIO_INT_MASK_M  (HINF_SDIO_INT_MASK_V << HINF_SDIO_INT_MASK_S)
#define HINF_SDIO_INT_MASK_V  0x00000001U
#define HINF_SDIO_INT_MASK_S  6
/** HINF_IOENABLE2 : RO; bitpos: [7]; default: 0;
 *  ioe2 status in cccr
 */
#define HINF_IOENABLE2    (BIT(7))
#define HINF_IOENABLE2_M  (HINF_IOENABLE2_V << HINF_IOENABLE2_S)
#define HINF_IOENABLE2_V  0x00000001U
#define HINF_IOENABLE2_S  7
/** HINF_CD_DISABLE : RO; bitpos: [8]; default: 0;
 *  card disable status in cccr
 */
#define HINF_CD_DISABLE    (BIT(8))
#define HINF_CD_DISABLE_M  (HINF_CD_DISABLE_V << HINF_CD_DISABLE_S)
#define HINF_CD_DISABLE_V  0x00000001U
#define HINF_CD_DISABLE_S  8
/** HINF_FUNC1_EPS : RO; bitpos: [9]; default: 0;
 *  function1 eps status in fbr
 */
#define HINF_FUNC1_EPS    (BIT(9))
#define HINF_FUNC1_EPS_M  (HINF_FUNC1_EPS_V << HINF_FUNC1_EPS_S)
#define HINF_FUNC1_EPS_V  0x00000001U
#define HINF_FUNC1_EPS_S  9
/** HINF_EMP : RO; bitpos: [10]; default: 0;
 *  empc status in cccr
 */
#define HINF_EMP    (BIT(10))
#define HINF_EMP_M  (HINF_EMP_V << HINF_EMP_S)
#define HINF_EMP_V  0x00000001U
#define HINF_EMP_S  10
/** HINF_IOENABLE1 : RO; bitpos: [11]; default: 0;
 *  ioe1 status in cccr
 */
#define HINF_IOENABLE1    (BIT(11))
#define HINF_IOENABLE1_M  (HINF_IOENABLE1_V << HINF_IOENABLE1_S)
#define HINF_IOENABLE1_V  0x00000001U
#define HINF_IOENABLE1_S  11
/** HINF_SDIO_VER : R/W; bitpos: [23:12]; default: 562;
 *  sdio version in cccr
 */
#define HINF_SDIO_VER    0x00000FFFU
#define HINF_SDIO_VER_M  (HINF_SDIO_VER_V << HINF_SDIO_VER_S)
#define HINF_SDIO_VER_V  0x00000FFFU
#define HINF_SDIO_VER_S  12
/** HINF_FUNC2_EPS : RO; bitpos: [24]; default: 0;
 *  function2 eps status in fbr
 */
#define HINF_FUNC2_EPS    (BIT(24))
#define HINF_FUNC2_EPS_M  (HINF_FUNC2_EPS_V << HINF_FUNC2_EPS_S)
#define HINF_FUNC2_EPS_V  0x00000001U
#define HINF_FUNC2_EPS_S  24
/** HINF_SDIO20_CONF : R/W; bitpos: [31:25]; default: 0;
 *  [29],sdio negedge sample enablel.[30],sdio posedge sample enable.[31],sdio cmd/dat
 *  in delayed cycles control,0:no delay, 1:delay 1 cycle.
 *  [25]: sdio1.1 dat/cmd sending out edge control,1:negedge,0:posedge when highseed
 *  mode.
 *  [26]: sdio2.0 dat/cmd sending out edge control,1:negedge when [12]=0,0:negedge when
 *  [12]=0,posedge when highspeed mode enable.
 *  [27]: sdio interrupt sending out delay control,1:delay one cycle, 0: no delay.
 *  [28]: sdio data pad pull up enable
 */
#define HINF_SDIO20_CONF    0x0000007FU
#define HINF_SDIO20_CONF_M  (HINF_SDIO20_CONF_V << HINF_SDIO20_CONF_S)
#define HINF_SDIO20_CONF_V  0x0000007FU
#define HINF_SDIO20_CONF_S  25

/** HINF_CFG_TIMING_REG register
 *  Timing configuration registers
 */
#define HINF_CFG_TIMING_REG (DR_REG_HINF_BASE + 0x8)
/** HINF_NCRC : R/W; bitpos: [2:0]; default: 2;
 *  configure Ncrc parameter in sdr50/104 mode, no more than 6.
 */
#define HINF_NCRC    0x00000007U
#define HINF_NCRC_M  (HINF_NCRC_V << HINF_NCRC_S)
#define HINF_NCRC_V  0x00000007U
#define HINF_NCRC_S  0
/** HINF_PST_END_CMD_LOW_VALUE : R/W; bitpos: [9:3]; default: 2;
 *  configure cycles to lower cmd after voltage is changed to 1.8V.
 */
#define HINF_PST_END_CMD_LOW_VALUE    0x0000007FU
#define HINF_PST_END_CMD_LOW_VALUE_M  (HINF_PST_END_CMD_LOW_VALUE_V << HINF_PST_END_CMD_LOW_VALUE_S)
#define HINF_PST_END_CMD_LOW_VALUE_V  0x0000007FU
#define HINF_PST_END_CMD_LOW_VALUE_S  3
/** HINF_PST_END_DATA_LOW_VALUE : R/W; bitpos: [15:10]; default: 2;
 *  configure cycles to lower data after voltage is changed to 1.8V.
 */
#define HINF_PST_END_DATA_LOW_VALUE    0x0000003FU
#define HINF_PST_END_DATA_LOW_VALUE_M  (HINF_PST_END_DATA_LOW_VALUE_V << HINF_PST_END_DATA_LOW_VALUE_S)
#define HINF_PST_END_DATA_LOW_VALUE_V  0x0000003FU
#define HINF_PST_END_DATA_LOW_VALUE_S  10
/** HINF_SDCLK_STOP_THRES : R/W; bitpos: [26:16]; default: 1400;
 *  Configure the number of cycles of module clk to judge sdclk has stopped
 */
#define HINF_SDCLK_STOP_THRES    0x000007FFU
#define HINF_SDCLK_STOP_THRES_M  (HINF_SDCLK_STOP_THRES_V << HINF_SDCLK_STOP_THRES_S)
#define HINF_SDCLK_STOP_THRES_V  0x000007FFU
#define HINF_SDCLK_STOP_THRES_S  16
/** HINF_SAMPLE_CLK_DIVIDER : R/W; bitpos: [31:28]; default: 1;
 *  module clk divider to sample sdclk
 */
#define HINF_SAMPLE_CLK_DIVIDER    0x0000000FU
#define HINF_SAMPLE_CLK_DIVIDER_M  (HINF_SAMPLE_CLK_DIVIDER_V << HINF_SAMPLE_CLK_DIVIDER_S)
#define HINF_SAMPLE_CLK_DIVIDER_V  0x0000000FU
#define HINF_SAMPLE_CLK_DIVIDER_S  28

