espressif/esp-idf/components/soc/esp32p4/include/soc/hinf_reg.h
/** HINF_CIS_CONF_W7_REG register
 *  SDIO cis configuration register
 */
#define HINF_CIS_CONF_W7_REG (DR_REG_HINF_BASE + 0x3c)
/** HINF_CIS_CONF_W7 : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configure cis addr 67~64
 */
#define HINF_CIS_CONF_W7    0xFFFFFFFFU
#define HINF_CIS_CONF_W7_M  (HINF_CIS_CONF_W7_V << HINF_CIS_CONF_W7_S)
#define HINF_CIS_CONF_W7_V  0xFFFFFFFFU
#define HINF_CIS_CONF_W7_S  0

/** HINF_CFG_DATA16_REG register
 *  SDIO cis configuration register
 */
#define HINF_CFG_DATA16_REG (DR_REG_HINF_BASE + 0x40)
/** HINF_DEVICE_ID_FN2 : R/W; bitpos: [15:0]; default: 30583;
 *  configure device id of function2 in cis
 */
#define HINF_DEVICE_ID_FN2    0x0000FFFFU
#define HINF_DEVICE_ID_FN2_M  (HINF_DEVICE_ID_FN2_V << HINF_DEVICE_ID_FN2_S)
#define HINF_DEVICE_ID_FN2_V  0x0000FFFFU
#define HINF_DEVICE_ID_FN2_S  0
/** HINF_USER_ID_FN2 : R/W; bitpos: [31:16]; default: 146;
 *  configure user id of function2 in cis
 */
#define HINF_USER_ID_FN2    0x0000FFFFU
#define HINF_USER_ID_FN2_M  (HINF_USER_ID_FN2_V << HINF_USER_ID_FN2_S)
#define HINF_USER_ID_FN2_V  0x0000FFFFU
#define HINF_USER_ID_FN2_S  16

/** HINF_CFG_UHS1_INT_MODE_REG register
 *  configure int to start and end ahead of time in uhs1 mode
 */
#define HINF_CFG_UHS1_INT_MODE_REG (DR_REG_HINF_BASE + 0x44)
/** HINF_INTOE_END_AHEAD_MODE : R/W; bitpos: [1:0]; default: 0;
 *  intoe on dat1 end ahead of time: 0/3-no, 1-ahead 1sdclk, 2-ahead 2sdclk
 */
#define HINF_INTOE_END_AHEAD_MODE    0x00000003U
#define HINF_INTOE_END_AHEAD_MODE_M  (HINF_INTOE_END_AHEAD_MODE_V << HINF_INTOE_END_AHEAD_MODE_S)
#define HINF_INTOE_END_AHEAD_MODE_V  0x00000003U
#define HINF_INTOE_END_AHEAD_MODE_S  0
/** HINF_INT_END_AHEAD_MODE : R/W; bitpos: [3:2]; default: 0;
 *  int on dat1 end ahead of time: 0/3-no, 1-ahead 1sdclk, 2-ahead 2sdclk
 */
#define HINF_INT_END_AHEAD_MODE    0x00000003U
#define HINF_INT_END_AHEAD_MODE_M  (HINF_INT_END_AHEAD_MODE_V << HINF_INT_END_AHEAD_MODE_S)
#define HINF_INT_END_AHEAD_MODE_V  0x00000003U
#define HINF_INT_END_AHEAD_MODE_S  2
/** HINF_INTOE_ST_AHEAD_MODE : R/W; bitpos: [5:4]; default: 0;
 *  intoe on dat1 start ahead of time: 0/3-no, 1-ahead 1sdclk, 2-ahead 2sdclk
 */
#define HINF_INTOE_ST_AHEAD_MODE    0x00000003U
#define HINF_INTOE_ST_AHEAD_MODE_M  (HINF_INTOE_ST_AHEAD_MODE_V << HINF_INTOE_ST_AHEAD_MODE_S)
#define HINF_INTOE_ST_AHEAD_MODE_V  0x00000003U
#define HINF_INTOE_ST_AHEAD_MODE_S  4
/** HINF_INT_ST_AHEAD_MODE : R/W; bitpos: [7:6]; default: 0;
 *  int on dat1 start ahead of time: 0/3-no, 1-ahead 1sdclk, 2-ahead 2sdclk
 */
#define HINF_INT_ST_AHEAD_MODE    0x00000003U
#define HINF_INT_ST_AHEAD_MODE_M  (HINF_INT_ST_AHEAD_MODE_V << HINF_INT_ST_AHEAD_MODE_S)
#define HINF_INT_ST_AHEAD_MODE_V  0x00000003U
#define HINF_INT_ST_AHEAD_MODE_S  6

/** HINF_CONF_STATUS_REG register
 *  func0 config0 status
 */
#define HINF_CONF_STATUS_REG (DR_REG_HINF_BASE + 0x54)
/** HINF_FUNC0_CONFIG0 : RO; bitpos: [7:0]; default: 0;
 *  func0 config0 (addr: 0x20f0 ) status
 */
#define HINF_FUNC0_CONFIG0    0x000000FFU
#define HINF_FUNC0_CONFIG0_M  (HINF_FUNC0_CONFIG0_V << HINF_FUNC0_CONFIG0_S)
#define HINF_FUNC0_CONFIG0_V  0x000000FFU
#define HINF_FUNC0_CONFIG0_S  0
/** HINF_SDR25_ST : RO; bitpos: [8]; default: 0;
 *  sdr25 status
 */
#define HINF_SDR25_ST    (BIT(8))
#define HINF_SDR25_ST_M  (HINF_SDR25_ST_V << HINF_SDR25_ST_S)
#define HINF_SDR25_ST_V  0x00000001U
#define HINF_SDR25_ST_S  8
/** HINF_SDR50_ST : RO; bitpos: [9]; default: 0;
 *  sdr50 status
 */
#define HINF_SDR50_ST    (BIT(9))
#define HINF_SDR50_ST_M  (HINF_SDR50_ST_V << HINF_SDR50_ST_S)
#define HINF_SDR50_ST_V  0x00000001U
#define HINF_SDR50_ST_S  9
/** HINF_SDR104_ST : RO; bitpos: [10]; default: 0;
 *  sdr104 status
 */
#define HINF_SDR104_ST    (BIT(10))
#define HINF_SDR104_ST_M  (HINF_SDR104_ST_V << HINF_SDR104_ST_S)
#define HINF_SDR104_ST_V  0x00000001U
#define HINF_SDR104_ST_S  10
/** HINF_DDR50_ST : RO; bitpos: [11]; default: 0;
 *  ddr50 status
 */
#define HINF_DDR50_ST    (BIT(11))
#define HINF_DDR50_ST_M  (HINF_DDR50_ST_V << HINF_DDR50_ST_S)
#define HINF_DDR50_ST_V  0x00000001U
#define HINF_DDR50_ST_S  11
/** HINF_TUNE_ST : RO; bitpos: [14:12]; default: 0;
 *  tune_st fsm status
 */
#define HINF_TUNE_ST    0x00000007U
#define HINF_TUNE_ST_M  (HINF_TUNE_ST_V << HINF_TUNE_ST_S)
#define HINF_TUNE_ST_V  0x00000007U
#define HINF_TUNE_ST_S  12
/** HINF_SDIO_SWITCH_VOLT_ST : RO; bitpos: [15]; default: 0;
 *  sdio switch voltage status:0-3.3V, 1-1.8V.
 */
#define HINF_SDIO_SWITCH_VOLT_ST    (BIT(15))
#define HINF_SDIO_SWITCH_VOLT_ST_M  (HINF_SDIO_SWITCH_VOLT_ST_V << HINF_SDIO_SWITCH_VOLT_ST_S)
#define HINF_SDIO_SWITCH_VOLT_ST_V  0x00000001U
#define HINF_SDIO_SWITCH_VOLT_ST_S  15
/** HINF_SDIO_SWITCH_END : RO; bitpos: [16]; default: 0;
 *  sdio switch voltage ldo ready
 */
#define HINF_SDIO_SWITCH_END    (BIT(16))
#define HINF_SDIO_SWITCH_END_M  (HINF_SDIO_SWITCH_END_V << HINF_SDIO_SWITCH_END_S)
#define HINF_SDIO_SWITCH_END_V  0x00000001U
#define HINF_SDIO_SWITCH_END_S  16

/** HINF_SDIO_SLAVE_ECO_LOW_REG register
 *  sdio_slave redundant control registers
 */
#define HINF_SDIO_SLAVE_ECO_LOW_REG (DR_REG_HINF_BASE + 0xa4)
/** HINF_RDN_ECO_LOW : R/W; bitpos: [31:0]; default: 0;
 *  redundant registers for sdio_slave
 */
#define HINF_RDN_ECO_LOW    0xFFFFFFFFU
#define HINF_RDN_ECO_LOW_M  (HINF_RDN_ECO_LOW_V << HINF_RDN_ECO_LOW_S)
#define HINF_RDN_ECO_LOW_V  0xFFFFFFFFU
#define HINF_RDN_ECO_LOW_S  0

/** HINF_SDIO_SLAVE_ECO_HIGH_REG register
 *  sdio_slave redundant control registers
 */
#define HINF_SDIO_SLAVE_ECO_HIGH_REG (DR_REG_HINF_BASE + 0xa8)
/** HINF_RDN_ECO_HIGH : R/W; bitpos: [31:0]; default: 4294967295;
 *  redundant registers for sdio_slave
 */
#define HINF_RDN_ECO_HIGH    0xFFFFFFFFU
#define HINF_RDN_ECO_HIGH_M  (HINF_RDN_ECO_HIGH_V << HINF_RDN_ECO_HIGH_S)
#define HINF_RDN_ECO_HIGH_V  0xFFFFFFFFU
#define HINF_RDN_ECO_HIGH_S  0

/** HINF_SDIO_SLAVE_ECO_CONF_REG register
 *  sdio_slave redundant control registers
 */
#define HINF_SDIO_SLAVE_ECO_CONF_REG (DR_REG_HINF_BASE + 0xac)
/** HINF_SDIO_SLAVE_RDN_RESULT : RO; bitpos: [0]; default: 0;
 *  redundant registers for sdio_slave
 */
#define HINF_SDIO_SLAVE_RDN_RESULT    (BIT(0))
#define HINF_SDIO_SLAVE_RDN_RESULT_M  (HINF_SDIO_SLAVE_RDN_RESULT_V << HINF_SDIO_SLAVE_RDN_RESULT_S)
#define HINF_SDIO_SLAVE_RDN_RESULT_V  0x00000001U
#define HINF_SDIO_SLAVE_RDN_RESULT_S  0
/** HINF_SDIO_SLAVE_RDN_ENA : R/W; bitpos: [1]; default: 0;
 *  redundant registers for sdio_slave
 */
#define HINF_SDIO_SLAVE_RDN_ENA    (BIT(1))
#define HINF_SDIO_SLAVE_RDN_ENA_M  (HINF_SDIO_SLAVE_RDN_ENA_V << HINF_SDIO_SLAVE_RDN_ENA_S)
#define HINF_SDIO_SLAVE_RDN_ENA_V  0x00000001U
#define HINF_SDIO_SLAVE_RDN_ENA_S  1
/** HINF_SDIO_SLAVE_SDIO_CLK_RDN_RESULT : RO; bitpos: [2]; default: 0;
 *  redundant registers for sdio_slave
 */
#define HINF_SDIO_SLAVE_SDIO_CLK_RDN_RESULT    (BIT(2))
#define HINF_SDIO_SLAVE_SDIO_CLK_RDN_RESULT_M  (HINF_SDIO_SLAVE_SDIO_CLK_RDN_RESULT_V << HINF_SDIO_SLAVE_SDIO_CLK_RDN_RESULT_S)
#define HINF_SDIO_SLAVE_SDIO_CLK_RDN_RESULT_V  0x00000001U
#define HINF_SDIO_SLAVE_SDIO_CLK_RDN_RESULT_S  2
/** HINF_SDIO_SLAVE_SDIO_CLK_RDN_ENA : R/W; bitpos: [3]; default: 0;
 *  redundant registers for sdio_slave
 */
#define HINF_SDIO_SLAVE_SDIO_CLK_RDN_ENA    (BIT(3))
#define HINF_SDIO_SLAVE_SDIO_CLK_RDN_ENA_M  (HINF_SDIO_SLAVE_SDIO_CLK_RDN_ENA_V << HINF_SDIO_SLAVE_SDIO_CLK_RDN_ENA_S)
#define HINF_SDIO_SLAVE_SDIO_CLK_RDN_ENA_V  0x00000001U
#define HINF_SDIO_SLAVE_SDIO_CLK_RDN_ENA_S  3
/** HINF_SDIO_SLAVE_SDCLK_PAD_RDN_RESULT : RO; bitpos: [4]; default: 0;
 *  redundant registers for sdio_slave
 */
#define HINF_SDIO_SLAVE_SDCLK_PAD_RDN_RESULT    (BIT(4))
#define HINF_SDIO_SLAVE_SDCLK_PAD_RDN_RESULT_M  (HINF_SDIO_SLAVE_SDCLK_PAD_RDN_RESULT_V << HINF_SDIO_SLAVE_SDCLK_PAD_RDN_RESULT_S)
#define HINF_SDIO_SLAVE_SDCLK_PAD_RDN_RESULT_V  0x00000001U
#define HINF_SDIO_SLAVE_SDCLK_PAD_RDN_RESULT_S  4
/** HINF_SDIO_SLAVE_SDCLK_PAD_RDN_ENA : R/W; bitpos: [5]; default: 0;
 *  redundant registers for sdio_slave
 */
#define HINF_SDIO_SLAVE_SDCLK_PAD_RDN_ENA    (BIT(5))
#define HINF_SDIO_SLAVE_SDCLK_PAD_RDN_ENA_M  (HINF_SDIO_SLAVE_SDCLK_PAD_RDN_ENA_V << HINF_SDIO_SLAVE_SDCLK_PAD_RDN_ENA_S)
#define HINF_SDIO_SLAVE_SDCLK_PAD_RDN_ENA_V  0x00000001U
#define HINF_SDIO_SLAVE_SDCLK_PAD_RDN_ENA_S  5

